<template>
  <div>
    <svg width="750" height="500">
      <path
        d="
          M 18 3
          L 46 3
          L 46 40
          L 61 40
          L 32 68
          L 3 40
          L 18 40
          Z
        "
      ></path>
    </svg>
  </div>
</template>

<script>

/*
创建一个 复杂 图标

TODO: path 元素，可创建直线，曲线...


M 表示移动到（moveto）。它用 x 值和 y 值来给定一条新的路径的起始点。可以想象成把你的鼠标放在画布上的某一点以准备开始绘画。大写的 M 表示移动到一个绝对坐标集合（小写的 m 表示移动到一个相对坐标集合）。
L 表示划线到（lineto）。从当前位置到新的位置画一条线。大写的 L 表示移动到一个绝对坐标集合（小写的 l 表示移动到一个相对坐标集合）。
Z 表示闭合路径。通过在当前点和路径的起始点之间画一条直线来闭合形状。

从这里开始，一次添加一个命令，保存并查看图标形状的进展，这样你就可以看到它是如何被创建出来的。我还建议将每个命令写成一行以提高可读性。

首先，我们移动到点 (18, 3) 处，这是我们的箭头开始的位置。为了完成这个动作，需要在路径的属性 d 中增加命令 M 18 3。
接着我们想使用 L 命令来从起始点开始沿着 x 轴画出一条 28px 的线段。为了完成这个动作，我们给属性 d 添加第二个命令：L 46 3。查看你浏览器预览，你会看到一条水平的短横线。
现在用 L 46 40 直接向下画一条 37px 的线。
然后用 L 61 40 直接向右进 15px。
接下来，我们要开始创建箭头点。我们需要向左下方画一条斜线。我们用 L 32 68 完成它。
然后用 L 3 40 画一条向左上方的斜线。
现在我们用 L 18 40 来向右边画一条线以完成我们的箭头。
为了使我们的形状闭合，我们无需通过指定一个点来画一条直线。我们所要做的就是添加 Z 命令，它会自动闭合我们的形状。



*/

export default {
  name: 'svg06'
}

</script>
